#include <stdio.h>
#include "functions.h"

int count = 83;
const char *head[] = {"编号", "姓名", "出生日期", "身份证", "语文", "数学", "英语"};

void printgap()
{
    for (int i = 0; i < count;i++)
    {
        printf("=");
    }
    printf("\n");
}

void printhead()
{
    printf("%13s|%20s|%16s|%23s|%8s|%8s|%8s\n", head[0], head[1], head[2], head[3], head[4], head[5], head[6]);
}

void showmenu()
{
    /*
    输入样例：
    在这里给出一组输入。例如：

    0
    输出样例：
    在这里给出相应的输出。例如：

    ===================================================================================
    1.添加学生信息
    2.查找学生信息
    3.修改学生信息
    4.删除学生信息
    5.排序学生信息
    6.显示所有学生信息
    0.退出系统
    ===================================================================================
    退出系统成功.
    */
    printgap();
    printf("1.添加学生信息\n2.查找学生信息\n3.修改学生信息\n4.删除学生信息\n5.排序学生信息\n6.显示所有学生信息\n0.退出系统\n");
    printgap();
}

void printstu(struct student p)
{
    printf("%10s|%20s|%4d-%2d-%2d|%20s|%5.1f|%5.1f|%5.1f\n",
           p.no, p.name, p.birthday.year, p.birthday.month, p.birthday.day, p.id, p.chinese, p.math, p.english);
}

void displayinfo()
{
    /*函数接口定义：
    1.先输出一行83个等号’=’的分割线
    2.显示学生信息字段名（标题）：编号13、姓名20、出生日期16、身份证23、语文8、数学8、英语8。字段名称右对齐，字段间用’|’区隔，字段长度见名称后面的数字。
    3.输出一行83个等号’=’的分割线
    4.遍历数组studentinfo 显示各学生信息，一行一个学生，每行格式如下：编号10，姓名20，出生日期YYYY-MM-DD，身份证20，成绩5位保留1位小数
    5.输出一行83个等号’=’的分割线
    6.输出共‘x’条记录

    输入样例：
    在这里给出一组输入。例如：

    6
    0
    输出样例：
    在这里给出相应的输出。例如：

    ===================================================================================
    1.添加学生信息
    2.查找学生信息
    3.修改学生信息
    4.删除学生信息
    5.排序学生信息
    6.显示所有学生信息
    0.退出系统
    ===================================================================================
    ===================================================================================
        编号|              姓名|    出生日期|              身份证|  语文|  数学|  英语
    ===================================================================================
    202501001|              李明|2005- 3- 1|  101110200503010123| 89.0| 91.0| 87.0
    202501002|              高亮|2025- 8-31|  352101200508310910| 78.0| 92.0| 67.0
    ===================================================================================
    ===================================================================================
    1.添加学生信息
    2.查找学生信息
    3.修改学生信息
    4.删除学生信息
    5.排序学生信息
    6.显示所有学生信息
    0.退出系统
    ===================================================================================
    退出系统成功.
    */
    printgap();
    printhead();
    for (int i = 0; i < rcount; i++)
    {
        printstu(studentinfo[i]);
    }
    printgap();
}